// node -r esm server.js

import express from 'express';
import cors from 'cors';

const app = express();
app.use(cors());
app.use(express.json());

let Recipes = [
    {
        id: 1,
        ingredients: [{
            name: "Яйця",
            amount: "3"
        },
        {
            name: "Цукор",
            amount: "80 г."
        },
        {
            name: "Борошно",
            amount: "60 г."
        },
        {
            name: "Какао",
            amount: "20 г."
        }
        ],
        title: "ШОКОЛАДНИЙ РУЛЕТ ІЗ КРЕМОМ",
        description: "Насичений смак шоколаду, п’янкі кавові нотки й невагомий заварний крем із запахом вершків та ванілі — шоколадний рулет легко приготувати для затишного домашнього чаювання і не соромно подати до святкового столу. Секрет ідеального шоколадного рулету — в пухкому борошні, свіжому молоці та якісному шоколаді. А також — у дбайливо приготованому заварному кремі без грудочок та достатньому просочуванні бісквіта солодким чаєм або кавою. Зробити шоколадний рулет оригінальним та вишуканим допоможе цікавий декор. Готовий десерт можна посипати цукровою пудрою чи кокосовою стружкою і додати ласощам зимового акценту; щедро полити ягідним соусом; прикрасити гілочкою м’яти або свіжими ягодами. А як вам ідея викласти зверху візерунок із різних видів подрібнених горіхів? Особливого блиску та ніжності рулету додасть шоколадна глазур. Ефектно і неймовірно смачно!"
    },
    {
        id: 2,
        ingredients: [{
            name: "Яйця",
            amount: "3"
        },
        {
            name: "Цукор",
            amount: "80 г."
        },
        {
            name: "Борошно",
            amount: "60 г."
        },
        {
            name: "Какао",
            amount: "20 г."
        }
        ],
        title: "ШОКОЛАДНИЙ РУЛЕТ ІЗ КРЕМОМ",
        description: "Насичений смак шоколаду, п’янкі кавові нотки й невагомий заварний крем із запахом вершків та ванілі — шоколадний рулет легко приготувати для затишного домашнього чаювання і не соромно подати до святкового столу. Секрет ідеального шоколадного рулету — в пухкому борошні, свіжому молоці та якісному шоколаді. А також — у дбайливо приготованому заварному кремі без грудочок та достатньому просочуванні бісквіта солодким чаєм або кавою. Зробити шоколадний рулет оригінальним та вишуканим допоможе цікавий декор. Готовий десерт можна посипати цукровою пудрою чи кокосовою стружкою і додати ласощам зимового акценту; щедро полити ягідним соусом; прикрасити гілочкою м’яти або свіжими ягодами. А як вам ідея викласти зверху візерунок із різних видів подрібнених горіхів? Особливого блиску та ніжності рулету додасть шоколадна глазур. Ефектно і неймовірно смачно!"
    },
    {
        id: 3,
        ingredients: [{
            name: "Яйця",
            amount: "3"
        },
        {
            name: "Цукор",
            amount: "80 г."
        },
        {
            name: "Борошно",
            amount: "60 г."
        },
        {
            name: "Какао",
            amount: "20 г."
        }
        ],
        title: "ШОКОЛАДНИЙ РУЛЕТ ІЗ КРЕМОМ",
        description: "Насичений смак шоколаду, п’янкі кавові нотки й невагомий заварний крем із запахом вершків та ванілі — шоколадний рулет легко приготувати для затишного домашнього чаювання і не соромно подати до святкового столу. Секрет ідеального шоколадного рулету — в пухкому борошні, свіжому молоці та якісному шоколаді. А також — у дбайливо приготованому заварному кремі без грудочок та достатньому просочуванні бісквіта солодким чаєм або кавою. Зробити шоколадний рулет оригінальним та вишуканим допоможе цікавий декор. Готовий десерт можна посипати цукровою пудрою чи кокосовою стружкою і додати ласощам зимового акценту; щедро полити ягідним соусом; прикрасити гілочкою м’яти або свіжими ягодами. А як вам ідея викласти зверху візерунок із різних видів подрібнених горіхів? Особливого блиску та ніжності рулету додасть шоколадна глазур. Ефектно і неймовірно смачно!"
    },
    {
        id: 4,
        ingredients: [{
            name: "Яйця",
            amount: "3"
        },
        {
            name: "Цукор",
            amount: "80 г."
        },
        {
            name: "Борошно",
            amount: "60 г."
        },
        {
            name: "Какао",
            amount: "20 г."
        }
        ],
        title: "ШОКОЛАДНИЙ РУЛЕТ ІЗ КРЕМОМ",
        description: "Насичений смак шоколаду, п’янкі кавові нотки й невагомий заварний крем із запахом вершків та ванілі — шоколадний рулет легко приготувати для затишного домашнього чаювання і не соромно подати до святкового столу. Секрет ідеального шоколадного рулету — в пухкому борошні, свіжому молоці та якісному шоколаді. А також — у дбайливо приготованому заварному кремі без грудочок та достатньому просочуванні бісквіта солодким чаєм або кавою. Зробити шоколадний рулет оригінальним та вишуканим допоможе цікавий декор. Готовий десерт можна посипати цукровою пудрою чи кокосовою стружкою і додати ласощам зимового акценту; щедро полити ягідним соусом; прикрасити гілочкою м’яти або свіжими ягодами. А як вам ідея викласти зверху візерунок із різних видів подрібнених горіхів? Особливого блиску та ніжності рулету додасть шоколадна глазур. Ефектно і неймовірно смачно!"
    },
    {
        id: 5,
        ingredients: [{
            name: "Яйця",
            amount: "3"
        },
        {
            name: "Цукор",
            amount: "80 г."
        },
        {
            name: "Борошно",
            amount: "60 г."
        },
        {
            name: "Какао",
            amount: "20 г."
        }
        ],
        title: "ШОКОЛАДНИЙ РУЛЕТ ІЗ КРЕМОМ",
        description: "Насичений смак шоколаду, п’янкі кавові нотки й невагомий заварний крем із запахом вершків та ванілі — шоколадний рулет легко приготувати для затишного домашнього чаювання і не соромно подати до святкового столу. Секрет ідеального шоколадного рулету — в пухкому борошні, свіжому молоці та якісному шоколаді. А також — у дбайливо приготованому заварному кремі без грудочок та достатньому просочуванні бісквіта солодким чаєм або кавою. Зробити шоколадний рулет оригінальним та вишуканим допоможе цікавий декор. Готовий десерт можна посипати цукровою пудрою чи кокосовою стружкою і додати ласощам зимового акценту; щедро полити ягідним соусом; прикрасити гілочкою м’яти або свіжими ягодами. А як вам ідея викласти зверху візерунок із різних видів подрібнених горіхів? Особливого блиску та ніжності рулету додасть шоколадна глазур. Ефектно і неймовірно смачно!"
    }
];

app.get('/Recipes', function (req, res) {
    res.send(Recipes);
})

app.get('/Recipes/:title', function (req, res) {
    let titleParam = req.params.title;
    let newArray = [];
    Recipes.map((el) => {
        if (el.title.toUpperCase().toString().includes(titleParam.toUpperCase())) {
            newArray.push(el);
        }

    })
    if (newArray)
        return res.send(newArray);

    res.status(304).send({ err: 304 });
})


app.post('/Recipes', (req, res) => {
    const Recipe = req.body;
    Recipe['ingredients'] = [];
    let dupl = false;
    Recipes.forEach(el => {
        if (el.title === Recipe.title) {
            res.sendStatus(304);
            dupl = true;
        }
    })
    if (!dupl) {
        Recipes.push(Recipe);
        res.send(Recipe);
    }
})

app.put('/Recipes', (req, res) => {
    const Recipe = req.body;
    let present = false;
    Recipes.map((el, index, tab) => {
        if (el.id === Recipe.id) {
            tab[index].title = Recipe.title;
            tab[index].description = Recipe.description;
            tab[index].ingredients = Recipe.ingredients;
            res.send(tab[index]);
            present = true;
        }
    });
    if (!present) res.sendStatus(304);
});

app.delete('/Recipes/:id', (req, res) => {
    const id = parseInt(req.params.id);
    let idx;
    let deleted = false;
    Recipes.map(el => {
        if (el.id === id) {
            idx = Recipes.indexOf(el);
            Recipes.splice(idx, 1);
            res.send(el);
            deleted = true;
        }
    });
    if (!deleted) res.sendStatus(304);
})

app.listen(8080, () =>
    console.log('Server started')
);